var pointList = [["山西焦煤集团五麟煤焦开发有限公司",111.6549693,37.18694761],
["山西焦煤集团五麟煤焦开发有限公司-甲醇厂",111.6487183,37.18822283],
["金塔山福利煤焦有限公司",111.67252,37.19422636],
["山西文峰焦化科技有限公司",111.7100873,37.24476197],
["山西东辉新能股份有限公司",111.6581577,37.19569706],
["中科渊昌再生能源有限公司",111.811249,37.22331008],
["山西国峰煤电有限责任公司",111.7347548,37.22728753],
["山西国峰污水处理厂（红源达）",111.8197318,37.24125825],
["山西杏花村汾酒股份有限公司",111.8643682,37.33881556],
["汾阳市远峰高钙石灰工业有限公司",111.5809554,37.32417644],
["汾阳市星宇化工有限责任公司",111.9244589,37.31958506],
["汾阳市鸿盛玻璃制品有限公司",111.7769691,37.29911939],
["汾阳市杏花村镇洁源污水处理有限公司",111.8742889,37.32538056],
["山西汾西正升煤业有限责任公司",111.6499222,37.2377495],
["东鑫橡胶",111.912738,37.230259],
["鸿涛橡胶",111.913022,37.229189],
["安泰橡胶",111.912483,37.229663]]


var convertFunc = coordtransform.wgs84togcj02
pointList.forEach(p => {
  var r = convertFunc(p[1],p[2])
  console.log(`${p[0]},${r[0]},${r[1]}`)
})